create_clock -period 16.666 -name phy_clk [get_ports phy_clk]

#set_input_delay  -clock [get_clocks phy_clk] -min  2.000 [get_ports {phy_dir}]
#set_input_delay  -clock [get_clocks phy_clk] -max  5.000 [get_ports {phy_dir}]
#set_multicycle_path 2 -from [get_ports {phy_dir}] -to [get_ports {phy_data[*]}]

set_input_delay -clock [get_clocks phy_clk] -min 2.000 [get_ports {phy_nxt}]
set_input_delay -clock [get_clocks phy_clk] -max 5.000 [get_ports {phy_nxt}]
set_input_delay -clock [get_clocks phy_clk] -min 2.000 [get_ports {phy_data[*]}]
set_input_delay -clock [get_clocks phy_clk] -max 5.000 [get_ports {phy_data[*]}]
set_output_delay -clock [get_clocks phy_clk] -min 0.000 [get_ports {phy_data[*]}]
set_output_delay -clock [get_clocks phy_clk] -max 11.666 [get_ports {phy_data[*]}]
set_output_delay -clock [get_clocks phy_clk] -min 0.000 [get_ports {phy_stp}]
set_output_delay -clock [get_clocks phy_clk] -max 11.666 [get_ports {phy_stp}]

create_debug_core u_ila_0 ila
set_property ALL_PROBE_SAME_MU true [get_debug_cores u_ila_0]
set_property ALL_PROBE_SAME_MU_CNT 2 [get_debug_cores u_ila_0]
set_property C_ADV_TRIGGER false [get_debug_cores u_ila_0]
set_property C_DATA_DEPTH 4096 [get_debug_cores u_ila_0]
set_property C_EN_STRG_QUAL true [get_debug_cores u_ila_0]
set_property C_INPUT_PIPE_STAGES 2 [get_debug_cores u_ila_0]
set_property C_TRIGIN_EN false [get_debug_cores u_ila_0]
set_property C_TRIGOUT_EN false [get_debug_cores u_ila_0]
set_property port_width 1 [get_debug_ports u_ila_0/clk]
connect_debug_port u_ila_0/clk [get_nets [list IO/ulpi_clk]]
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe0]
set_property port_width 8 [get_debug_ports u_ila_0/probe0]
connect_debug_port u_ila_0/probe0 [get_nets [list {ulpi_data_in[0]} {ulpi_data_in[1]} {ulpi_data_in[2]} {ulpi_data_in[3]} {ulpi_data_in[4]} {ulpi_data_in[5]} {ulpi_data_in[6]} {ulpi_data_in[7]}]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe1]
set_property port_width 8 [get_debug_ports u_ila_0/probe1]
connect_debug_port u_ila_0/probe1 [get_nets [list {ulpi_data_out[0]} {ulpi_data_out[1]} {ulpi_data_out[2]} {ulpi_data_out[3]} {ulpi_data_out[4]} {ulpi_data_out[5]} {ulpi_data_out[6]} {ulpi_data_out[7]}]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe2]
set_property port_width 1 [get_debug_ports u_ila_0/probe2]
connect_debug_port u_ila_0/probe2 [get_nets [list ulpi_dir]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe3]
set_property port_width 1 [get_debug_ports u_ila_0/probe3]
connect_debug_port u_ila_0/probe3 [get_nets [list ulpi_nxt]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe4]
set_property port_width 1 [get_debug_ports u_ila_0/probe4]
connect_debug_port u_ila_0/probe4 [get_nets [list ulpi_rst]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe5]
set_property port_width 1 [get_debug_ports u_ila_0/probe5]
connect_debug_port u_ila_0/probe5 [get_nets [list ulpi_stp]]
set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
connect_debug_port dbg_hub/clk [get_nets ulpi_clk]
